# coding: utf-8
# Author: wanhui0729@gmail.com

"""
默认配置
"""

from yacs.config import CfgNode as CN

_C = CN()

# -----------------------------------------------------------------------------
# Config definition
# -----------------------------------------------------------------------------

_C.MODEL = CN()
# 训练设备类型
_C.MODEL.DEVICE = "cpu"

# ---------------------------------------------------------------------------- #
# Backbone options
# ---------------------------------------------------------------------------- #
_C.MODEL.BACKBONE = CN()
# 输入通道
_C.MODEL.BACKBONE.IN_CHANNELS = 0